#ifndef	CONFIG_H
#define CONFIG_H

// Ќе думайте что названи€ переменных включают "ECB" дл€ самопиара. 
// ѕросто это наиболее простой и верный способ обезопасить себ€ от возможности 
// того, что мои переменные и переменные оригинальных шейдеров пересекутс€ на одном имени.

// бќльшие значени€ дают бќльшие значени€ соответствующего параметра конфига погоды в скобках
#define ECB_FOG_COLOR 0.93 // ”множение €ркости тумана (fog_color)
#define ECB_FOG_DIST 0.9 // ”множение рассто€ни€ тумана (fog_distance)

#define ECB_BUMP_MUL 1.h // √лубина бампа, 1/х

// shadows
#define	ECB_SHADOW_KERNEL	1.5f // Ўирина одиночных полосок-переходов в тен€х
#define ECB_SHADOW_STEPS 6 // integer; количество полосок перехода тени от светлой к темной. 

uniform sampler 	s_smap;		// 2D/cube shadowmap

#define USE_ECBOPTS // задействовать оптимизации

#endif
